In [4]:
import pandas as pd
import numpy as np
import random

# Import symbol
from reader_tools.GenericCSVReader import DataframeFromCSV

In [ ]:
df = DataframeFromCSV("StudentsPerformance.csv")

##### SET NEW INDEXES

Of course they have to be unique

In [ ]:
new_index = np.arange(0, 1000)
type(new_index)

numpy.ndarray

In [8]:
random.shuffle(new_index)

In [9]:
new_index

array([679, 545, 324, 991, 162, 697, 559, 306, 104, 597, 974, 151,  12,
       114, 845, 238, 461, 321, 883, 404, 685,   5, 900, 591, 273, 119,
       642, 742,  79, 976, 265, 593, 791, 293, 378, 422, 999, 869, 347,
       120, 288, 906, 227,  10, 576, 806, 218, 790, 719, 899, 944, 215,
       304, 942, 136, 749, 925, 708, 348, 352, 117, 810, 297, 984, 244,
       650, 390,  14, 195, 646, 467, 626, 698, 699, 395, 838, 170, 727,
       987, 695, 485, 239, 182, 829, 318, 424, 176, 774, 932,  19, 519,
       401, 834, 733,  37, 988, 283, 294,  60, 446, 669, 649, 188, 194,
       543, 889, 262, 723, 891, 236, 406, 248, 225,  18, 687, 631, 586,
       473, 645, 619, 905, 601, 338, 286, 443,  44, 279, 782,  62, 139,
       888, 764, 411, 426,  52, 106, 893, 990, 656, 202, 563, 270,  80,
       374,  70, 564, 992, 843, 274, 300, 917, 482, 542, 172,  45, 751,
       356, 817, 234, 566, 240, 400, 798, 292,  64, 214, 701, 804, 980,
       187, 186, 756, 796, 755, 979, 460, 337, 637, 229, 544, 381, 301,
       155, 902, 821, 103, 871,  89, 110, 137, 605, 655, 654, 660, 715,
       251, 977, 163, 434, 644, 739,  97, 232, 947, 636, 800, 144, 916,
       675, 496, 132,  21, 333, 865, 770, 577, 123, 884, 157, 367, 258,
       285, 726, 269, 203, 449, 981, 908, 204, 529, 912, 201, 562,   6,
       831, 673,  26, 950, 105, 516,  47, 773, 633, 766, 622, 678, 920,
       848, 860,  28, 190, 885, 951, 788, 825, 692, 233, 425, 125, 643,
       217, 465, 444, 127, 811, 671, 483, 938, 886, 168, 508, 512, 750,
        29, 823, 455, 639, 849, 716, 539, 452, 355, 714,   1, 178,  30,
       389,  55, 808, 397, 608, 940, 330,   7, 728, 651, 511, 537, 997,
       911, 345, 941, 329, 448, 191, 890, 606, 213, 915, 307, 417, 305,
       536, 299, 199, 503, 588, 315, 975, 686, 308, 181, 289, 965, 506,
       520,  87, 133, 499, 174, 183, 761, 241, 475, 666, 326, 208, 492,
       571, 585, 846, 360, 115, 291, 598, 371, 702, 561, 778, 530,  11,
        93, 211,  41, 587, 960, 670, 513, 736, 691,  23, 862, 458, 694,
       447,  17, 464, 787, 456, 662, 111, 603, 550, 359, 540,  42, 129,
       298, 479, 922, 615, 382, 962, 584, 818, 568, 430, 689, 926, 260,
       150, 877,  76, 949, 212, 565, 526,  46, 350, 995, 505, 498, 495,
       184, 812, 777, 745, 101,  58, 632, 573, 746, 575, 278,  13, 803,
       522, 611, 398, 630, 334, 734, 961, 459, 948, 463, 705, 122, 412,
       141, 765, 866, 837, 617, 628, 231, 840, 783, 599, 963, 688, 914,
       413, 657,  91, 819, 478, 552, 327,  35, 677, 206, 735, 612, 851,
       554, 882, 427, 451, 439, 690, 841, 514, 969, 880, 255,  95, 146,
       416, 681,  36, 830, 323, 929, 440, 706, 445, 457, 910,  86,  74,
       556, 895, 772, 126, 647, 314, 867, 346, 887, 752, 809, 102, 393,
       712, 354, 648, 548, 363, 570, 130, 858, 263, 408, 713, 878, 409,
       613, 919, 487, 131, 794, 828, 388, 982, 775, 180, 361, 432, 268,
       970, 956, 140, 481, 403, 223, 173, 358, 826, 476, 267, 419, 590,
       815, 759, 872, 560, 936, 624, 369,  83, 436, 797, 549,  84, 627,
       897,  49,  90, 780, 523, 641, 616,  53, 296, 711,  88, 700,   8,
       515, 720, 246, 776, 349, 216, 618, 209, 596, 574, 507, 295, 855,
       319, 658, 429, 898, 336, 470, 879, 164, 725, 193, 952,  81, 320,
       192, 377, 351, 741, 220, 249, 998, 484, 521, 431, 954, 373, 477,
       169, 156,   0, 789, 684, 177, 290,  99, 986, 510, 847, 967, 589,
       385, 620, 595, 200, 640, 653, 664,  20, 387, 210, 683, 112, 235,
       799, 175, 881, 718, 557, 546,  66, 410,  73, 471, 824, 302, 362,
       418,  68, 372, 256, 732, 365, 827, 896, 931, 524, 814, 501, 738,
       368, 414,  50, 207, 857, 600, 943,  65, 850, 737, 154, 504, 230,
       856, 971,  72, 835, 394, 904, 668, 722, 852,  85, 205, 341, 243,
       875, 109, 927, 399, 121,   4, 768, 165, 124, 518, 226,  38, 538,
       509, 842, 909,  33, 580, 903, 167, 634, 328,  40, 707, 623, 935,
       276, 405,  39, 224, 228, 957, 493, 973, 731, 442, 567, 488, 247,
       964, 934, 771, 569, 454, 266,  16, 357,  71, 161, 100, 704, 525,
       894, 753,  61, 747, 438, 189, 682, 763, 364, 784, 978, 921, 953,
       709, 625, 663, 284, 281, 993, 280, 822, 861, 312, 282,  78, 143,
       955, 316, 582, 946, 863, 661, 311,  82, 740, 437, 407, 396, 317,
       665, 572, 786, 222, 748, 994, 392, 754, 433, 873, 391, 219, 272,
       868, 128, 148, 578, 420,  57, 532, 844,  15, 779, 259, 760, 983,
       785, 930, 116, 466, 158, 472, 198, 254, 972, 939, 303, 602, 435,
        31, 693, 489, 781, 415, 237, 494, 528, 332, 744, 870, 674, 166,
       197, 801, 696, 968, 659, 366, 383, 901, 453, 386, 500, 874, 553,
        96, 614, 153, 672,  75, 257,  63,  51, 729, 937, 340,  27, 134,
       502, 423,   2, 517, 474,  67, 793, 913, 854, 277, 145, 313, 379,
       757, 958,  69, 721, 196, 795, 710, 380, 535, 876, 261, 833, 853,
       159, 762, 592, 245, 918, 491, 547,  77, 275, 185, 138, 113,  24,
       450, 310, 621, 118, 309, 250, 384, 264, 933, 717, 769, 610, 792,
       179, 343, 147, 441,  59,  94, 462, 652, 497, 160, 816, 638, 928,
       802,   9, 344, 758, 836, 581, 966, 724, 985, 252, 152,   3, 342,
       142,  22, 805, 594,  32, 989,  25, 271, 402, 635, 551, 996,  56,
       531, 555, 108, 820, 924, 421, 376, 331, 149, 892, 609, 107, 370,
       428, 242, 253, 864, 813, 541, 558,  98,  34, 135, 527,  92, 469,
        43, 375, 480, 353, 607, 604, 667, 832, 583, 171, 859, 468,  54,
       579, 221,  48, 703, 325, 807, 534, 945, 486, 839, 730, 743, 959,
       923, 335, 490, 629, 680, 339, 533, 322, 287, 676, 767, 907])

In [11]:
df["new_index"] = new_index
df

     gender race/ethnicity  ... writing score new_index
0    female        group B  ...            74       679
1    female        group C  ...            88       545
2    female        group B  ...            93       324
3      male        group A  ...            44       991
4      male        group C  ...            75       162
..      ...            ...  ...           ...       ...
995  female        group E  ...            95       322
996    male        group C  ...            55       287
997  female        group C  ...            65       676
998  female        group D  ...            77       767
999  female        group D  ...            86       907

[1000 rows x 9 columns]

In [12]:
df.set_index("new_index")

           gender race/ethnicity  ... reading score writing score
new_index                         ...
679        female        group B  ...            72            74
545        female        group C  ...            90            88
324        female        group B  ...            95            93
991          male        group A  ...            57            44
162          male        group C  ...            78            75
...           ...            ...  ...           ...           ...
322        female        group E  ...            99            95
287          male        group C  ...            55            55
676        female        group C  ...            71            65
767        female        group D  ...            78            77
907        female        group D  ...            86            86

[1000 rows x 8 columns]

##### SORT INDEX

In [13]:
df.sort_index()

     gender race/ethnicity  ... writing score new_index
0    female        group B  ...            74       679
1    female        group C  ...            88       545
2    female        group B  ...            93       324
3      male        group A  ...            44       991
4      male        group C  ...            75       162
..      ...            ...  ...           ...       ...
995  female        group E  ...            95       322
996    male        group C  ...            55       287
997  female        group C  ...            65       676
998  female        group D  ...            77       767
999  female        group D  ...            86       907

[1000 rows x 9 columns]